views/inventory/index.php

        <div class="row">
            <div class="col-md-2"><?= $form->field($searchModel, 'code')->textInput(['placeholder' => 'Ej: PROD-001']) ?></div>
            <div class="col-md-2"><?= $form->field($searchModel, 'name')->textInput(['placeholder' => 'Buscar por nombre']) ?></div>
            <div class="col-md-2"><?= $form->field($searchModel, 'category_id')->dropDownList(
                \yii\helpers\ArrayHelper::map(\app\models\Category::find()->all(), 'id', 'name'),
                ['prompt' => 'Todas las categorías']
            ) ?></div>
            <div class="col-md-2"><?= $form->field($searchModel, 'supplier_id')->dropDownList(
                \yii\helpers\ArrayHelper::map(\app\models\Supplier::find()->all(), 'id', 'name'),
                ['prompt' => 'Todos los proveedores']
            ) ?></div>
---
SELECT * FROM `category`
SELECT * FROM `supplier`