controllers/InventoryController.php

SELECT COUNT(*) FROM `product`
SELECT COUNT(*) FROM `product` WHERE `stock` > 0
SELECT COUNT(*) FROM `product` WHERE stock <= min_stock AND stock > 0
SELECT COUNT(*) FROM `product` WHERE `stock` <= 0
---
    public function actionIndex()
    {
        $searchModel = new \app\models\ProductSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);

        // Estadísticas rápidas
        $total = \app\models\Product::find()->count();
        $inStock = \app\models\Product::find()->where(['>', 'stock', 0])->count();
        $lowStock = \app\models\Product::find()->where('stock <= min_stock AND stock > 0')->count();
        $outStock = \app\models\Product::find()->where(['<=', 'stock', 0])->count();