controllers/SaleController.php

SELECT * FROM `sale` WHERE `date` BETWEEN '2025-06-01' AND '2025-06-06' ORDER BY `date` DESC
---
    public function actionReport()
    {
        $fromDate = Yii::$app->request->post('from_date', date('Y-m-01'));
        $toDate = Yii::$app->request->post('to_date', date('Y-m-d'));

        $sales = Sale::find()
            ->where(['between', 'date', $fromDate, $toDate])
            ->orderBy(['date' => SORT_DESC])
            ->all();