controllers/SiteController.php

    public function actionDashboard()
    {
        $lowStockProducts = Product::find()
            ->where('stock <= min_stock')
            ->limit(5)
            ->all();

        $recentSales = Sale::find()
            ->orderBy(['id' => SORT_DESC])
            ->limit(5)
            ->all();

        $totalProducts = Product::find()->count();
        $totalSuppliers = Supplier::find()->count();
        $totalSales = Sale::find()->count();
        $salesAmount = Sale::find()->sum('total_amount');
---
SELECT * FROM `product` WHERE stock <= min_stock LIMIT 5
SELECT * FROM `sale` ORDER BY `id` DESC LIMIT 5
SELECT COUNT(*) FROM `product`
SELECT COUNT(*) FROM `supplier`
SELECT COUNT(*) FROM `sale`
SELECT SUM(total_amount) FROM `sale`