controllers/UserController.php

    public function actionProfile()
    {
        $userId = Yii::$app->user->id;
        $model = \app\models\User::findOne($userId); // <-- Carga el modelo real
---
SELECT * FROM `user` WHERE `id`=5